# Задача 4: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
# 10 -> 1 2 4 8

# N = (int(input('Введите число N ')))
#stop = 0
#P = 2
#for i in range(N):
#    if stop != 1:
#        P = P ** i
#        if P <= N:
#            print (P, end=' ')
#            P = 2
#        else:
#            stop = 1
#    else:
#        i = N
#-----------------------

# Задача 2: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. 
# Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. 
# Помогите Кате отгадать задуманные Петей числа.
#4 4 -> 2 2
#5 6 -> 2 3   
      
#x = (int(input('Введите первое натуральное число X ')))
#y = (int(input('Введите второе натуральное число Y ')))
#if x < 1 or x > 1000 or y < 1 or y > 1000:
#    print('Вы ввели число не из заданного диапазона!')
#S = x + y
#P = x * y
#y1 = int((S + ((-S) ** 2 - 4 * P) ** 0.5) / 2)
#x1 = int((S - ((-S) ** 2 - 4 * P) ** 0.5) / 2)
#print(x1, y1)
#-----------------

#Пользователь вводит текст(строка). Словом считается последовательность непробельных символов идущих подряд, 
# слова разделены одним или большим числом пробелов или символами конца строки.Определите, сколько различных
#слов содержится в этом тексте.
#5 -> 1 0 1 1 0

A = {}
a = (str(input('Введите текст ')))
for x in a:
    A[x] = A.get(x, 0) + 1
    print(A[x] - 1, end=' ')
    