#Задача 30: Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и 
# количество элементов нужно ввести с клавиатуры. Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
#Каждое число вводится с новой строки.

# a1 = int(input("Введите первый элемент: "))
# d = int(input("Введите разность: "))
# n = int(input("Введите количество элементов: "))
# list = []
# for i in range(1,n+1):
#     i = a1+(i-1)*d
#     list.append(i)
# print(list)
#---------------------------------

# Задача 32: Определить индексы элементов массива (списка), 
# значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)

list_1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
list_2 = []
min = int(input("Введите минимальное значение: "))
max = int(input("Введите максимальное значение: "))
for i in range(len(list_1)):
    if list_1[i] >= min and list_1[i] <= max:
        list_2.append(i)
print(list_2)
        


    
    

 
